# AddSeparator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PulldownButton..::..AddSeparator Method
PulldownButton Class See Also
---
Adds a separator to the drop-down list.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void AddSeparator()
```

Visual Basic
---
```text
Public Sub AddSeparator
```

Visual C++
---
```text
public:
void AddSeparator()
```

# Remarks
The separator will appear just below the last added PushButton.
# See Also
PulldownButton Class
Autodesk.Revit.UI Namespace